FirmwareArmy/samd21/src/core++/core.h
#pragma once

#include <stdint.h>


#if defined(__SAMD21E15BU__) || defined(__ATSAMD21E15BU__)
#    include <core++/samd21e15bu++.h>
#elif defined(__SAMD21G17A__) || defined(__ATSAMD21G17A__)
#    include <core++/samd21g17a++.h>
#elif defined(__SAMD21G15A__) || defined(__ATSAMD21G15A__)
#    include <core++/samd21g15a++.h>
#elif defined(__SAMD21G15B__) || defined(__ATSAMD21G15B__)
#    include <core++/samd21g15b++.h>
#elif defined(__SAMD21E16L__) || defined(__ATSAMD21E16L__)
#    include <core++/samd21e16l++.h>
#elif defined(__SAMD21G15L__) || defined(__ATSAMD21G15L__)
#    include <core++/samd21g15l++.h>
#elif defined(__SAMD21E16B__) || defined(__ATSAMD21E16B__)
#    include <core++/samd21e16b++.h>
#elif defined(__SAMD21E16A__) || defined(__ATSAMD21E16A__)
#    include <core++/samd21e16a++.h>
#elif defined(__SAMD21G17L__) || defined(__ATSAMD21G17L__)
#    include <core++/samd21g17l++.h>
#elif defined(__SAMD21E16BU__) || defined(__ATSAMD21E16BU__)
#    include <core++/samd21e16bu++.h>
#elif defined(__SAMD21E17DU__) || defined(__ATSAMD21E17DU__)
#    include <core++/samd21e17du++.h>
#elif defined(__SAMD21E17L__) || defined(__ATSAMD21E17L__)
#    include <core++/samd21e17l++.h>
#elif defined(__SAMD21G17D__) || defined(__ATSAMD21G17D__)
#    include <core++/samd21g17d++.h>
#elif defined(__SAMD21J15A__) || defined(__ATSAMD21J15A__)
#    include <core++/samd21j15a++.h>
#elif defined(__SAMD21G18A__) || defined(__ATSAMD21G18A__)
#    include <core++/samd21g18a++.h>
#elif defined(__SAMD21G17AU__) || defined(__ATSAMD21G17AU__)
#    include <core++/samd21g17au++.h>
#elif defined(__SAMD21J17D__) || defined(__ATSAMD21J17D__)
#    include <core++/samd21j17d++.h>
#elif defined(__SAMD21J17A__) || defined(__ATSAMD21J17A__)
#    include <core++/samd21j17a++.h>
#elif defined(__SAMD21E15CU__) || defined(__ATSAMD21E15CU__)
#    include <core++/samd21e15cu++.h>
#elif defined(__SAMD21E15B__) || defined(__ATSAMD21E15B__)
#    include <core++/samd21e15b++.h>
#elif defined(__SAMD21E15A__) || defined(__ATSAMD21E15A__)
#    include <core++/samd21e15a++.h>
#elif defined(__SAMD21E17A__) || defined(__ATSAMD21E17A__)
#    include <core++/samd21e17a++.h>
#elif defined(__SAMD21E15L__) || defined(__ATSAMD21E15L__)
#    include <core++/samd21e15l++.h>
#elif defined(__SAMD21E17D__) || defined(__ATSAMD21E17D__)
#    include <core++/samd21e17d++.h>
#elif defined(__SAMD21J15B__) || defined(__ATSAMD21J15B__)
#    include <core++/samd21j15b++.h>
#elif defined(__SAMD21G16L__) || defined(__ATSAMD21G16L__)
#    include <core++/samd21g16l++.h>
#elif defined(__SAMD21E16CU__) || defined(__ATSAMD21E16CU__)
#    include <core++/samd21e16cu++.h>
#elif defined(__SAMD21G16A__) || defined(__ATSAMD21G16A__)
#    include <core++/samd21g16a++.h>
#elif defined(__SAMD21G16B__) || defined(__ATSAMD21G16B__)
#    include <core++/samd21g16b++.h>
#elif defined(__SAMD21J16B__) || defined(__ATSAMD21J16B__)
#    include <core++/samd21j16b++.h>
#elif defined(__SAMD21G18AU__) || defined(__ATSAMD21G18AU__)
#    include <core++/samd21g18au++.h>
#elif defined(__SAMD21J16A__) || defined(__ATSAMD21J16A__)
#    include <core++/samd21j16a++.h>
#elif defined(__SAMD21E18A__) || defined(__ATSAMD21E18A__)
#    include <core++/samd21e18a++.h>
#elif defined(__SAMD21J18A__) || defined(__ATSAMD21J18A__)
#    include <core++/samd21j18a++.h>
#endif
